   /*/----------------------!!!----------------------------/*/
  /*/ Before compilation Save with Encoding Windows 1251  /*/
 /*/              Saved in Encoding UTF-8                /*/
/*/-------------------------!!!-------------------------/*/
#include <stdio.h>
#include "default_cfg.h"
/*
SetColor(14,0); | жовний вивід тексту на екран + чорний фон
SetColor(10,0); | повернення зеленого виводу тексту на екран + чорний фон
*/
int summ_S3(char *S1, char *S3); // Визначає скільки є голосних букв у двох рядках

int main(void) {
start_cfg(); //default_cfg.h

int summ=0;
char S1[14] = "Перше речення"; // Перший рядок, містить 5 голосних букв: 4 - е, 1 - я
char S2[14] = "Друге речення";// Другий рядок, містить 5 голосних букв: 1 - у, 3 - е, 1 - я
char S3[11] = "аеиіоуяюєї"; // Голосні букви

puts("\nПерший рядок:");
SetColor(14,0);
puts(S1);
SetColor(10,0);

puts("\nДругий рядок:");
SetColor(14,0);
puts(S2);
SetColor(10,0);

puts("\nГолосні букви:");
SetColor(14,0);
puts(S3);
SetColor(10,0);

summ += summ_S3(S1, S3); // функція повертає кількість голосних букв в першому рядку
summ += summ_S3(S2, S3);// функція повертає кількість голосних букв в другому рядку

printf("\nКількість голосних букв: ");
SetColor(14,0);
printf("%d\n", summ);
SetColor(10,0);

end_cfg(); //default_cfg.h
return 0;
}

//////////////////////////////////////////////////////////////////////////////////
int summ_S3(char *S1, char *S3){
	int summ = 0;
	for (int i = 0; S1[i] != '\0'; i++)
	{
		for (int j = 0; S3[j] != '\0'; j++)
		{		
			if (S1[i] == S3[j]) //якщо в масиві S1 зустрічається голосна буква (S3) збільшує суму на одиницю
			{
				// printf("\nS1[%d] = %c", i, S1[i]); //debug
				// printf("\nS3[%d] = %c\n", j, S3[j]); //debug
				summ++;
			}
		}
	}
return summ;  //повертає кількість голосних букв
}