   /*/----------------------!!!----------------------------/*/
  /*/ Before compilation Save with Encoding Windows 1251  /*/
 /*/              Saved in Encoding UTF-8                /*/
/*/-------------------------!!!-------------------------/*/
#include <stdio.h>
#include "default_cfg.h"
/*
SetColor(14,0); | жовний вивід тексту на екран + чорний фон
SetColor(12,0); | червоний вивід тексту на екран + чорний фон
SetColor(10,0); | повернення зеленого виводу тексту на екран + чорний фон
*/
void clear_spaces(char *s1); //видаляє з речення зайві пробіли
char* A_dell(char *s1); //завдання А | видаляє всі слова, що мають подвоєні літери;
int B_summ_word(char *s); //завдання Б | підраховує кількість слів у тексті.
void number_words(char *s1); //виводить на екран кількість слів у тексті

int main(void) {
start_cfg(); //default_cfg.h

// char s1[] = "  речення1    Слово1    та       речення2 Слово2 і речення3 Слово3   "; //debug
char s1[80]; //debug
printf("Задайте рядок : "); //debug
SetColor(14,0); //debug | жовний вивід тексту на екран
gets(s1); //debug 
SetColor(10,0); //debug | повернення зеленого виводу на екран

// puts("\nВведене речення:"); //debug
// SetColor(14,0); //debug
// puts(s1); //debug
// SetColor(10,0); //debug
clear_spaces(s1);

number_words(s1);
if (B_summ_word(s1) == 0){
	SetColor(12,0);
	puts("\n\nНе було введено ні одного слова");
	SetColor(10,0);
}
	else if (A_dell(s1) == NULL){
		SetColor(12,0);
		puts("\n\nПісля видаленя всіх слів, де є подвоєні літери, не залишилось ні одного слова");
		SetColor(10,0);
	}
		else {
			clear_spaces(s1);
			puts("\n\nРечення після видаленя всіх слів, де є подвоєні літери:");
			SetColor(14,0);
			puts(s1);
			SetColor(10,0);
			number_words(s1);
		}

end_cfg(); //default_cfg.h
return 0;
}
//////////////////////////////////////////////////////////////////////////////////
void number_words(char *s1){
	printf("\nКількість слів: ");
	SetColor(14,0);
	printf("%d\n", B_summ_word(s1));
	SetColor(10,0);
}
//////////////////////////////////////////////////////////////////////////////////
void clear_spaces(char *s1){
int i = 0, ss = 0, k = 0, m = 0;
for (i = 0; s1[i] != '\0'; i++)
{
	if (s1[i] == ' ' && s1[i+1] == ' ') //залишає лише по одному пробілу
	{
		for (ss = i+1; s1[ss] != '\0'; ss++)
		{
			s1[ss] = s1[ss+1];
		}
		i = 0;
	}
	if (s1[0] == ' ') // якщо перед текстом були пробіли - видаляє їх
	{
		do{
			for (m = 0; s1[m] != '\0'; m++)
			{
				s1[m] = s1[m+1];
			}
		}while(s1[0] == ' ');
	}

	if (s1[i] == ' ' && s1[i+1] == '\0'){ // якщо в кінці текста були пробіли - видаляє їх
		for (k = i; s1[k] == ' '; k--){}
		// printf("--------------| %c\n", s1[k+1]); //debug
		s1[k+1] = '\0';
		// SetColor(12,0); //debug
		// printf("----------\n"); //debug
		// SetColor(10,0); //debug
	}
}
}
//////////////////////////////////////////////////////////////////////////////////
char* A_dell(char *s1){
int i = 0, j = 0, k = 0, l = 0;

for (i = 0; s1[i] != '\0'; i++)
{
	if (s1[i] == s1[i+1]) // якщо знайдено два одинакові символи:
	{
		for (j = i; j != 0 && s1[j] != ' '; j--){} // шукаєм початок слова
		for (k = i; s1[k] != ' ' && s1[k] != '\0'; k++){} // шукаєм кінець слова
// SetColor(14,0); //debug
// puts(s1); //debug
// SetColor(10,0); //debug
// printf("індекс подвоєння = %d | %c\n", i, s1[i]); //debug
// printf("індекс початку = %d | %c\n", j, s1[j]); //debug
// printf("індекс кінця = %d | %c\n\n", k, s1[k]); //debug
		for (l = j; s1[l] != '\0'; l++) //зсуваєм рядок заміщаючи зайве слово
		{
			s1[l] = s1[k];
			k++;
		}
		i = 0;
	}
}

if (strlen(s1) == 0) // якщо після видалення зайвих слів довжина рядка дорівнює нулю повертає NULL інакше повертає рядок
{
	return NULL;
} else return s1;
}
//////////////////////////////////////////////////////////////////////////////////
int B_summ_word(char *s){
	if (strlen(s) == 0) //якщо довжина рядка дорівнює нулю - то й нема шо рахувати
	{
		return 0;
	}
	int summ = 1;
	for (int i = 0; s[i] != '\0'; i++)
	{
		if (s[i] == ' ') //слова вичисляються за кількість пробілів, після останнього слова пробіла немає тому summ = 1, до цього моменту всі зайві пробіли видалені за допомогою функції clear_spaces 
		{
			summ++;
		}
	}
	return summ;
}